nRFMesh/nRF52_Mesh/drivers/mesh.c
/** @file mesh.c
 *
 * @author Wassim FILALI
 *
 * @compiler arm gcc
 *
 *
 * $Date: 31.05.2018 adding doxy header and mesh commander functions
 *
*/

#include "mesh.h"

#include "sdk_common.h"
#include "sdk_config.h"

#include "boards.h"

#include "nrf_esb.h"
#include "nrf_esb_error_codes.h"

#include "nrf_drv_timer.h"

#include "nrf_delay.h"
#include <stdio.h>
//for sprint_buf
#include "utils.h"

#if defined( __GNUC__ ) && (__LINT__ == 0)
    // This is required if one wants to use floating-point values in 'printf'
    // (by default this feature is not linked together with newlib-nano).
    // Please note, however, that this adds about 13 kB code footprint...
    __ASM(".global _printf_float");
#endif

#define NRF_LOG_MODULE_NAME mesh

#if (MESH_CONFIG_LOG_ENABLED == 1)
#define NRF_LOG_LEVEL MESH_CONFIG_LOG_LEVEL
#else //MESH_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL 0
#endif //MESH_CONFIG_LOG_ENABLED

#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();


#define Mesh_Pid_Alive 0x05
#define Mesh_Pid_Reset 0x04
#define Mesh_Pid_Button 0x06

//light was 16bit redefined u32 bit
#define Mesh_Pid_Light 0x07
#define Mesh_Pid_Temperature 0x08
//bme280 no more with uncalibrated params
#define Mesh_Pid_bme        0x0A
//following rgb is led color control
#define Mesh_Pid_led_rgb    0x0B
#define Mesh_Pid_light_rgb  0x0E
#define Mesh_Pid_Humidity   0x11
#define Mesh_Pid_Pressure   0x12
#define Mesh_Pid_accell     0x13
#define Mesh_Pid_new_light  0x14
#define Mesh_Pid_Battery    0x15
#define Mesh_Pid_ExecuteCmd 0xEC

#define MESH_IS_BROADCAST(val) ((val & 0x80) == 0x80)
#define MESH_IS_PEER2PEER(val) ((val & 0x80) == 0x00)
//Ack if bits 1,2 == 1,0 => MASK 0x60, VAL 0x40
#define MESH_IS_ACKNOWLEDGE(val) ((val & 0x60) == 0x40)
#define MESH_WANT_ACKNOWLEDGE(val) ((val & 0xF0) == 0x70)

#define MESH_Broadcast_Header_Length 4
#define MESH_P2P_Header_Length 5

#define MESH_cmd_node_id_set        0x01
#define MESH_cmd_node_id_get        0x02
#define MESH_cmd_rf_chan_set        0x03
#define MESH_cmd_rf_chan_get        0x04
#define MESH_cmd_tx_power_set       0x05
#define MESH_cmd_tx_power_get       0x06
#define MESH_cmd_bitrate_set        0x07
#define MESH_cmd_bitrate_get        0x08
#define MESH_cmd_crc_set            0x09
#define MESH_cmd_crc_get            0x0A


const char * const pid_name[] = {  "",          //0x00
                                "ping",         //0x01
                                "request_pid",  //0x02
                                "0x03",         //0x03
                                "reset",        //0x04
                                "alive",        //0x05
                                "button",       //0x06
                                "light",        //0x07
                                "temperature",  //0x08
                                "heat",         //0x09
                                "bme",          //0x0A
                                "rgb",          //0x0B
                                "magnet",       //0x0C
                                "dimmer",       //0x0D
                                "light_rgb",    //0x0E
                                "gesture",      //0x0F
                                "proximity",    //0x10
                                "humidity",     //0x11
                                "pressure",     //0x12
                                "acceleration", //0x13
                                "light_n",      //0x14
                                "Battery",      //0x15
                                "" };    

#include "uicr_user_defines.h"


static nrf_esb_config_t     nrf_esb_config         = NRF_ESB_DEFAULT_CONFIG;
static nrf_esb_payload_t    tx_payload = NRF_ESB_CREATE_PAYLOAD(0, 0x01, 0x00);
static nrf_esb_payload_t    rx_payload;
static message_t rx_msg;
static volatile bool esb_completed = false;
static volatile bool esb_tx_complete = false;

static app_mesh_rf_handler_t m_app_rf_handler;

static app_mesh_cmd_handler_t m_app_cmd_handler;

//forward internal declarations
void mesh_tx_message(message_t* msg);
uint32_t mesh_tx_ack(message_t* msg, uint8_t ttl);
uint32_t mesh_forward_message(message_t* msg);
void mesh_execute_cmd(uint8_t*data,uint8_t size);
bool window_check_retransmit();

//-------------------------------------------------------------
//----------------------- Payload Store -----------------------
//-------------------------------------------------------------
#if (TIMER_ENABLED == 1)
const nrf_drv_timer_t TIMER_ACK = NRF_DRV_TIMER_INSTANCE(0);

/**
 * @brief Handler for timer events.
 */
void timer_ack_event_handler(nrf_timer_event_t event_type, void* p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            if(!window_check_retransmit())
            {
                nrf_drv_timer_disable(&TIMER_ACK);
            }
            break;
        default:
            //Do nothing.
            break;
    }
}
#endif /*TIMER_ENABLED*/



typedef struct
{
    bool is_waiting_ack;
    uint32_t timeout;
    uint32_t count;
    nrf_esb_payload_t payload;
}esb_payload_store_t;

#define PAYLOAD_STORE_SIZE 2

static esb_payload_store_t  tx_payload_window[PAYLOAD_STORE_SIZE];

/**
 * @brief Get the tx payload object from the Store in case a retransmission might be required
 * Otherwise the global tx_payload if no retransmission required or none available on which case
 * re-transmission would not be performed
 * 
 * @param control 
 * @return nrf_esb_payload_t* 
 */
nrf_esb_payload_t* window_get_payload(uint8_t control)
{
    nrf_esb_payload_t* res = NULL;
    if((UICR_RTX_Timeout != 0xFFFFFFFF) && (UICR_RTX_Count != 0xFFFFFFFF))
    {
        if((UICR_RTX_Timeout != 0) && (UICR_RTX_Count != 0))
        {
            if(MESH_WANT_ACKNOWLEDGE(control))
            {
                //find one free and assign it
                for(int i=0;(i<PAYLOAD_STORE_SIZE)&&(res==NULL);i++)
                {
                    if(!tx_payload_window[i].is_waiting_ack)
                    {
                        res = &tx_payload_window[i].payload;
                        tx_payload_window[i].is_waiting_ack = true;
                        tx_payload_window[i].timeout    = UICR_RTX_Timeout;
                        tx_payload_window[i].count      = UICR_RTX_Count;
                    }
                }
            }
        }
    }

    if(res == NULL)//in both fails from control test or no store available test
    {
        res = &tx_payload;
    }
    else
    {
        #if(TIMER_ENABLED == 1)
        nrf_drv_timer_enable(&TIMER_ACK);
        #endif /*TIMER_ENABLED*/
    }

    return res;
}

bool is_matching_msg_ack(message_t* msg,nrf_esb_payload_t *p_payload)
{
    if(msg->pid != p_payload->data[2])//0:Length, 1:Ctrl, 2:pid
    {
        return false;
    }
    if(msg->source != p_payload->data[4])//compare source with dest (dest is @ 4)
    {
        return false;
    }
    if(msg->dest != p_payload->data[3])//compare dest with source (source is @ 3)
    {
        return false;
    }
    return true;    
}

void window_remove_payload(message_t* msg)
{
    bool found = false;
    for(int i=0;(i<PAYLOAD_STORE_SIZE)&&(!found);i++)
    {
        if(tx_payload_window[i].is_waiting_ack)
        {
            if(is_matching_msg_ack(msg,&tx_payload_window[i].payload))
            {
                //TODO if serial cmd request, should report the rtx count
                tx_payload_window[i].is_waiting_ack = false;
                found = true;
            }
        }
    }
}

/**
 * @brief 
 * 
 * @return true the timer is still required
 * @return false no timeout still required
 */
bool window_check_retransmit()
{
    bool timer_still_required = false;
    for(int i=0;i<PAYLOAD_STORE_SIZE;i++)
    {
        if(tx_payload_window[i].is_waiting_ack)
        {
            bool this_timeout_is_still_required = true;
            if(--tx_payload_window[i].timeout == 0)
            {
                //retransmit
                nrf_esb_write_payload(&tx_payload_window[i].payload);
                if(--tx_payload_window[i].count == 0)
                {
                    //retransmit count over !!!!! free the slot
                    tx_payload_window[i].is_waiting_ack = false;
                    this_timeout_is_still_required = false;
                }
                //restart a new timeout for the next count
                tx_payload_window[i].timeout      = UICR_RTX_Timeout;
            }
            if(this_timeout_is_still_required)
            {
                timer_still_required = true;
            }
        }
    }
    return timer_still_required;
}

//-------------------------------------------------------------
//------------------------- Mesh Core -------------------------
//-------------------------------------------------------------

