nRFMesh/nRF52_Mesh/drivers/mesh.c
    err_code = nrf_esb_set_base_address_1(base_addr_1);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_prefixes(addr_prefix, 8);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_rf_channel(UICR_RF_CHANNEL);
    VERIFY_SUCCESS(err_code);

    tx_payload.length  = 8;
    tx_payload.pipe    = 0;
    tx_payload.data[0] = 0x00;

    NRF_LOG_INFO("nodeId %d",UICR_NODE_ID);
    NRF_LOG_INFO("channel %d",UICR_RF_CHANNEL);


    #if (TIMER_ENABLED == 1)
        nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
        err_code = nrf_drv_timer_init(&TIMER_ACK, &timer_cfg, timer_ack_event_handler);
        VERIFY_SUCCESS(err_code);

        uint32_t time_ticks = nrf_drv_timer_ms_to_ticks(&TIMER_ACK, 1);//1 ms

        nrf_drv_timer_extended_compare(
            &TIMER_ACK, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

        nrf_drv_timer_enable(&TIMER_ACK);
    #endif/*TIMER_ENABLED*/

    if(UICR_is_listening())
    {
        err_code = nrf_esb_start_rx();
        VERIFY_SUCCESS(err_code);
        NRF_LOG_INFO("UICR listening");
    }
    else
    {
        NRF_LOG_INFO("UICR Not listening");
    }


    return NRF_SUCCESS;
}

/**
 * @brief can be used before going into sleep as RADIO does not operate in low power
 * This will return either after success or failure event
 */
void mesh_wait_tx()
{
    while(!esb_completed);
}

//--------------------------------------------------------------------------
//------------------------- Messages Serialisation -------------------------
//--------------------------------------------------------------------------


/**
 * @brief required TX raw as it prevents partial copies before using the same mesh_tx_message
 * Note that the length is not expected to be the first byte here as it will be added
 * 
 * @param p_data 
 * @param size 
 */
void mesh_tx_raw(uint8_t* p_data,uint8_t size)
{
    mesh_pre_tx();

    nrf_esb_payload_t * p_tx_payload = window_get_payload(p_data[0]);//Starts with control as first byte
    p_tx_payload->length   = size + 1;//as size itself is now added
    p_tx_payload->data[0] = p_tx_payload->length;
    memcpy( p_tx_payload->data+1,
            p_data,
            size);

    esb_completed = false;//reset the check
    nrf_esb_write_payload(p_tx_payload);
}
/**
 * @brief Transmits a message structure
 * 
 * @param msg : the message structure to be converted to an esb buffer and sent through nrf_esb_write_payload
 */
void mesh_tx_message(message_t* p_msg)
{
    mesh_pre_tx();

    nrf_esb_payload_t * p_tx_payload = window_get_payload(p_msg->control);
    mesh_message_2_esb_payload(p_msg,p_tx_payload);

    esb_completed = false;//reset the check
    NRF_LOG_DEBUG("________________TX esb payload length = %d________________",p_tx_payload->data[0]);
    //should not wait for esb_completed here as does not work from ISR context

    //NRF_ESB_TXMODE_AUTO is used no need to call nrf_esb_start_tx()
    //which could be used for a precise time transmission
    nrf_esb_write_payload(p_tx_payload);
    
    //nrf_esb_start_tx();//as the previous mode does not start it due to .mode
}

/**
 * @brief Transmits a button message
 * 
 * @param state button state press 0 or release 1
 * @return uint32_t NRF_SUCCESS
 */
uint32_t mesh_tx_button(uint8_t state)
{
    message_t msg;

    msg.control = 0x80 | 2;         // broadcast | ttl = 2
    msg.pid     = Mesh_Pid_Button;
    msg.source  = UICR_NODE_ID;
    msg.payload = &state;       //this will only be used from within the context of this function
    msg.payload_length = 1;

    mesh_tx_message(&msg);

    return NRF_SUCCESS;
}


uint32_t mesh_tx_ack(message_t* msg, uint8_t ttl)
{
    message_t ack;

    ack.control = 0x40 | ttl;         // ack | ttl = 2
    ack.pid     = msg->pid;
    ack.source  = msg->dest;        // == UICR_NODE_ID
    ack.dest    = msg->source;
    ack.payload_length = 0;

    mesh_tx_message(&ack);

    return NRF_SUCCESS;
}

uint32_t mesh_forward_message(message_t* msg)
{
    uint8_t ttl = msg->control & 0x0F;
    if(ttl>0)
    {
        ttl--;
        uint8_t ctrl_backup = msg->control;
        msg->control &= 0xF0;//clear ttl
        msg->control |= ttl;
        mesh_tx_message(msg);
        msg->control = ctrl_backup;//set it back as it was
    }

    return NRF_SUCCESS;
}


/**
 * @brief Sends a simple message that has no payload, by providing only the pid
 * 
 * @param pid the application protocol id : e.g. reset,...
 * @return uint32_t 
 */
uint32_t mesh_tx_pid(uint8_t pid)
{
    message_t msg;

    msg.control = 0x80 | 2;         // broadcast | ttl = 2
    msg.pid     = pid;
    msg.source  = UICR_NODE_ID;
    msg.payload_length = 0;

    mesh_tx_message(&msg);

    return NRF_SUCCESS;
}

/**
 * @brief Sends a reset message, used usually when a device wakes up from reset
 * Combined in a database, it keeps history of when the device was first started
 * Of whether the device has reset du to any error
 * 
 */
void mesh_tx_reset()
{
    mesh_tx_pid(Mesh_Pid_Reset);
}

void mesh_tx_data(uint8_t pid,uint8_t * data,uint8_t size)
{
    message_t msg;

    msg.control = 0x80 | 2;         // broadcast | ttl = 2
    msg.pid     = pid;
    msg.source  = UICR_NODE_ID;
    msg.payload = data;
    msg.payload_length = size;

    mesh_tx_message(&msg);
}

/**
 * @brief Broadcast an alive packet with associated payload information
 * The payload contains a livecounter (uint32_t) and the RF transmission power (int8_t)
 * 
 */
uint32_t mesh_tx_alive()
{
    static uint32_t live_count = 0;

    uint8_t data[5];
    data[0] = 0xFF & (uint8_t)(live_count >> 24);
    data[1] = 0xFF & (uint8_t)(live_count >> 16);
    data[2] = 0xFF & (uint8_t)(live_count >> 8);
    data[3] = 0xFF & (uint8_t)(live_count );
    data[4] = NRF_RADIO->TXPOWER;

    mesh_tx_data(Mesh_Pid_Alive,data,5);
    
    return live_count++;//returns the first used value before the increment
}



void mesh_tx_light(uint32_t light)
{
    mesh_tx_data(Mesh_Pid_Light,(uint8_t*)&light,4);
}

